## solutions week 7 in class exercise

In [2]:
import pandas as pd
import numpy as np

## Practice

Using the World Cup Matches Datasets from the Data Wrangling Notebook:
    
1. Select the following columns: MatchID, Year, Stage, Home Team Name, Away Team Name, Home Team Goals, Away Team Goals.
    
2. Clean the column names.    
    
3. Convert this data to the long format, having both a single collumn for the team playing and the goals scored  

4. Which team have played more games in the history of the world cup?

5. Which team have a higher average of goals in the history of the world cup?

In [12]:
# load worldcup dataset
wc = pd.read_csv("WorldCups.csv")
wc_matches = pd.read_csv("WorldCupMatches.csv")

wc_matches.index

RangeIndex(start=0, stop=852, step=1)

In [4]:
# 1 and 2
wc_copy = (wc_matches.filter(["MatchID", "Year", "Stage", 
                              "Home Team Name", 
                              "Away Team Name", "Home Team Goals", 
                              "Away Team Goals"]).
     rename(columns={col: col.lower().replace(" ", "_") for col in wc_matches.columns}).copy()
)

In [14]:
help(pd.melt)

Help on function melt in module pandas.core.reshape.melt:

melt(frame: 'DataFrame', id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None, ignore_index: 'bool' = True) -> 'DataFrame'
    Unpivot a DataFrame from wide to long format, optionally leaving identifiers set.

    This function is useful to massage a DataFrame into a format where one
    or more columns are identifier variables (`id_vars`), while all other
    columns, considered measured variables (`value_vars`), are "unpivoted" to
    the row axis, leaving just two non-identifier columns, 'variable' and
    'value'.

    Parameters
    ----------
    id_vars : tuple, list, or ndarray, optional
        Column(s) to use as identifier variables.
    value_vars : tuple, list, or ndarray, optional
        Column(s) to unpivot. If not specified, uses all columns that
        are not set as `id_vars`.
    var_name : scalar
        Name to use for the 'variable' column. If None it uses
        ``frame.columns.name`` or 'variable'.
    value_name : scalar, default 'value'
        Name to use for the 'value' column.
    col_level : int or str, optional
        If columns are a MultiIndex then use this level to melt.
    ignore_index : bool, default True
        If True, original index is ignored. If False, the original index is retained.
        Index labels will be repeated as necessary.

        .. versionadded:: 1.1.0

    Returns
    -------
    DataFrame
        Unpivoted DataFrame.

    See Also
    --------
    DataFrame.melt : Identical method.
    pivot_table : Create a spreadsheet-style pivot table as a DataFrame.
    DataFrame.pivot : Return reshaped DataFrame organized
        by given index / column values.
    DataFrame.explode : Explode a DataFrame from list-like
            columns to long format.

    Notes
    -----
    Reference :ref:`the user guide <reshaping.melt>` for more examples.

    Examples
    --------
    >>> df = pd.DataFrame({'A': {0: 'a', 1: 'b', 2: 'c'},
    ...                    'B': {0: 1, 1: 3, 2: 5},
    ...                    'C': {0: 2, 1: 4, 2: 6}})
    >>> df
       A  B  C
    0  a  1  2
    1  b  3  4
    2  c  5  6

    >>> pd.melt(df, id_vars=['A'], value_vars=['B'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5

    >>> pd.melt(df, id_vars=['A'], value_vars=['B', 'C'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5
    3  a        C      2
    4  b        C      4
    5  c        C      6

    The names of 'variable' and 'value' columns can be customized:

    >>> pd.melt(df, id_vars=['A'], value_vars=['B'],
    ...         var_name='myVarname', value_name='myValname')
       A myVarname  myValname
    0  a         B          1
    1  b         B          3
    2  c         B          5

    Original index values can be kept around:

    >>> pd.melt(df, id_vars=['A'], value_vars=['B', 'C'], ignore_index=False)
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5
    0  a        C      2
    1  b        C      4
    2  c        C      6

    If you have multi-index columns:

    >>> df.columns = [list('ABC'), list('DEF')]
    >>> df
       A  B  C
       D  E  F
    0  a  1  2
    1  b  3  4
    2  c  5  6

    >>> pd.melt(df, col_level=0, id_vars=['A'], value_vars=['B'])
       A variable  value
    0  a        B      1
    1  b        B      3
    2  c        B      5

    >>> pd.melt(df, id_vars=[('A', 'D')], value_vars=[('B', 'E')])
      (A, D) variable_0 variable_1  value
    0      a          B          E      1
    1      b          B          E      3
    2      c          B          E      5

In [16]:
wc_copy.filter(["matchid", "year", "stage", "home_team_name", "away_team_name"])

       matchid  year                     stage home_team_name away_team_name
0         1096  1930                   Group 1         France         Mexico
1         1090  1930                   Group 4            USA        Belgium
2         1093  1930                   Group 2     Yugoslavia         Brazil
3         1098  1930                   Group 3        Romania           Peru
4         1085  1930                   Group 1      Argentina         France
..         ...   ...                       ...            ...            ...
847  300186488  2014            Quarter-finals    Netherlands     Costa Rica
848  300186474  2014               Semi-finals         Brazil        Germany
849  300186490  2014               Semi-finals    Netherlands      Argentina
850  300186502  2014  Play-off for third place         Brazil    Netherlands
851  300186501  2014                     Final        Germany      Argentina

[852 rows x 5 columns]

In [13]:
# 3
wc_home = (wc_copy.
    filter(["matchid", "year", "stage", "home_team_name", "away_team_name"]).
    melt(id_vars=["matchid", "year", "stage"], 
            var_name="team_host", 
            value_name="team_name").
    assign(team_host= lambda x: x["team_host"].str.replace("_team_name", ""))
)
wc_home

        matchid  year                     stage team_host    team_name
0          1096  1930                   Group 1      home       France
1          1090  1930                   Group 4      home          USA
2          1093  1930                   Group 2      home   Yugoslavia
3          1098  1930                   Group 3      home      Romania
4          1085  1930                   Group 1      home    Argentina
...         ...   ...                       ...       ...          ...
1699  300186488  2014            Quarter-finals      away   Costa Rica
1700  300186474  2014               Semi-finals      away      Germany
1701  300186490  2014               Semi-finals      away    Argentina
1702  300186502  2014  Play-off for third place      away  Netherlands
1703  300186501  2014                     Final      away    Argentina

[1704 rows x 5 columns]

In [17]:
# 3
wc_goals = (wc_copy.
    filter(["matchid", "year", "stage", "home_team_goals", "away_team_goals"]).
    melt(id_vars=["matchid","year", "stage"], 
             var_name="team_host", 
            value_name="team_goals").
    filter(["matchid","team_host", "team_goals"])
    
)
wc_goals

        matchid        team_host  team_goals
0          1096  home_team_goals           4
1          1090  home_team_goals           3
2          1093  home_team_goals           2
3          1098  home_team_goals           3
4          1085  home_team_goals           1
...         ...              ...         ...
1699  300186488  away_team_goals           0
1700  300186474  away_team_goals           7
1701  300186490  away_team_goals           0
1702  300186502  away_team_goals           3
1703  300186501  away_team_goals           0

[1704 rows x 3 columns]

In [21]:
wc_home.head()

   matchid  year    stage team_host   team_name
0     1096  1930  Group 1      home      France
1     1090  1930  Group 4      home         USA
2     1093  1930  Group 2      home  Yugoslavia
3     1098  1930  Group 3      home     Romania
4     1085  1930  Group 1      home   Argentina

In [22]:
wc_goals.head()

   matchid        team_host  team_goals
0     1096  home_team_goals           4
1     1090  home_team_goals           3
2     1093  home_team_goals           2
3     1098  home_team_goals           3
4     1085  home_team_goals           1

In [8]:
# 3
wc_tidy = pd.concat([wc_home, wc_goals],axis=1)

wc_tidy

,matchid,year,stage,team_host,team_name,matchid,team_host,team_goals
0,1096,1930,Group 1,home,France,1096,home_team_goals,4
1,1090,1930,Group 4,home,USA,1090,home_team_goals,3
2,1093,1930,Group 2,home,Yugoslavia,1093,home_team_goals,2
3,1098,1930,Group 3,home,Romania,1098,home_team_goals,3
4,1085,1930,Group 1,home,Argentina,1085,home_team_goals,1
...,...,...,...,...,...,...,...,...
1699,300186488,2014,Quarter-finals,away,Costa Rica,300186488,away_team_goals,0
1700,300186474,2014,Semi-finals,away,Germany,300186474,away_team_goals,7
1701,300186490,2014,Semi-finals,away,Argentina,300186490,away_team_goals,0
1702,300186502,2014,Play-off for third place,away,Netherlands,300186502,away_team_goals,3
1703,300186501,2014,Final,away,Argentina,300186501,away_team_goals,0

In [9]:
# 4
(wc_tidy
     .groupby(["team_name"], as_index=False)
     ["team_name"]
     .size()
     .sort_values("size", ascending=False)
)

                   team_name  size
7                     Brazil   108
39                     Italy    83
2                  Argentina    81
25                   England    62
29                Germany FR    62
..                       ...   ...
44                    Kuwait     3
1                     Angola     3
40                   Jamaica     3
82  rn">United Arab Emirates     3
21         Dutch East Indies     1

[83 rows x 2 columns]

In [10]:
# 5
(wc_tidy
     .groupby(["team_name"], as_index=False)
     ["team_goals"]
     .agg(["mean", "count"])
     .sort_values("mean", ascending=False). 
    head(10)
)

                  mean  count
team_name
Hungary       2.718750     32
Germany       2.166667     48
Germany FR    2.112903     62
Brazil        2.083333    108
Turkey        2.000000     10
France        1.770492     61
Soviet Union  1.709677     31
Denmark       1.687500     16
Netherlands   1.685185     54
Cuba          1.666667      3